<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data shape="1,3,518,518" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="x">
					<dim>1</dim>
					<dim>3</dim>
					<dim>518</dim>
					<dim>518</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="aten::expand/Broadcast_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="0" size="768" />
			<output>
				<port id="0" precision="FP16" names="64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="aten::expand/Broadcast" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="x/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="768" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="4" name="x/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="772" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="5" name="x/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="768" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="6" name="x/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="772" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="7" name="x/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>518</dim>
					<dim>518</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>518</dim>
					<dim>518</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_546449" type="Const" version="opset1">
			<data element_type="i8" shape="384, 3, 14, 14" offset="776" size="225792" />
			<output>
				<port id="0" precision="I8">
					<dim>384</dim>
					<dim>3</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Convert_546450" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>384</dim>
					<dim>3</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>3</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_546451" type="Const" version="opset1">
			<data element_type="f32" shape="384, 1, 1, 1" offset="226568" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.pretrained.patch_embed.proj/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>3</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>384</dim>
					<dim>3</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="__module.pretrained.patch_embed.proj/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="14, 14" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>518</dim>
					<dim>518</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>3</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.pretrained.patch_embed.proj/aten::_convolution/Reshape_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 384, 1, 1" offset="228104" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.pretrained.patch_embed.proj/aten::_convolution/Reshape" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.pretrained.patch_embed.proj/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="162,x.3">
					<dim>1</dim>
					<dim>384</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.pretrained.patch_embed/aten::flatten/Concat" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="228872" size="12" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.pretrained.patch_embed/aten::flatten/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="163">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1369</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="__module.pretrained.patch_embed/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="228884" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="__module.pretrained.patch_embed/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>384</dim>
					<dim>1369</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="164,x.5">
					<dim>1</dim>
					<dim>1369</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="aten::cat/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1369</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="67,x.7">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="aten::add/Multiply_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1370, 384" offset="228896" size="1052160" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="aten::add/Multiply" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="69,input.1">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module.pretrained.blocks.0.norm1/aten::layer_norm/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="1281056" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.pretrained.blocks.0.norm1/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_15347_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="1281060" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_15347" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.pretrained.blocks.0.norm1/aten::layer_norm/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_15348_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="1281828" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_15348" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="__module.pretrained.blocks.0.norm1/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="191,x.9">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.pretrained.blocks.0.norm1/aten::layer_norm/Add_0_0/nncf_smooth_quant/scale" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="1282596" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.pretrained.blocks.0.norm1/aten::layer_norm/Add_0_0/nncf_smooth_quant" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="__module.pretrained.blocks.0.norm1/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1284132" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="35" name="__module.pretrained.blocks.0.norm1/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1284136" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="36" name="__module.pretrained.blocks.0.norm1/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1284132" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="37" name="__module.pretrained.blocks.0.norm1/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1284136" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="38" name="__module.pretrained.blocks.0.norm1/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Constant_546454" type="Const" version="opset1">
			<data element_type="i8" shape="1152, 384" offset="1284140" size="442368" />
			<output>
				<port id="0" precision="I8">
					<dim>1152</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Convert_546455" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>1152</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1152</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_546456" type="Const" version="opset1">
			<data element_type="f32" shape="1152, 1" offset="1726508" size="4608" />
			<output>
				<port id="0" precision="FP32">
					<dim>1152</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="__module.pretrained.blocks.0.attn.qkv/aten::linear/MatMul/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1152</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1152</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1152</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.pretrained.blocks.0.attn.qkv/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1152</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>1152</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_15349_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1152" offset="1731116" size="2304" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1152</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_15349" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1152</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1152</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.pretrained.blocks.0.attn.qkv/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>1152</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1152</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="200">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>1152</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.pretrained.blocks.0.attn/prim::ListConstruct/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="1733420" size="40" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="203">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.pretrained.blocks.0.attn/aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>1152</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="204">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>3</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_339" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="1733460" size="40" />
			<output>
				<port id="0" precision="I64" names="205">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.pretrained.blocks.0.attn/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>3</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="206,qkv.1">
					<dim>3</dim>
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="166" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1733500" size="8" />
			<output>
				<port id="0" precision="I64" names="166" />
			</output>
		</layer>
		<layer id="52" name="__module.pretrained.blocks.0.attn/aten::select/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="207">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_15350_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1, 1" offset="1733508" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_15350" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="__module.pretrained.blocks.0.attn/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="208,q.1">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="__module.pretrained.blocks.0.attn/aten::mul/Multiply/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1733510" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="57" name="__module.pretrained.blocks.0.attn/aten::mul/Multiply/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1733514" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="58" name="__module.pretrained.blocks.0.attn/aten::mul/Multiply/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1733510" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="59" name="__module.pretrained.blocks.0.attn/aten::mul/Multiply/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1733514" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="60" name="__module.pretrained.blocks.0.attn/aten::mul/Multiply/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.pretrained.blocks.0.attn/aten::select/Gather_1/fq_input_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1733518" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="62" name="__module.pretrained.blocks.0.attn/aten::select/Gather_1/fq_input_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1733522" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="63" name="__module.pretrained.blocks.0.attn/aten::select/Gather_1/fq_input_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1733518" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="64" name="__module.pretrained.blocks.0.attn/aten::select/Gather_1/fq_input_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1733522" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="65" name="__module.pretrained.blocks.0.attn/aten::select/Gather_1/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="167" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1733526" size="8" />
			<output>
				<port id="0" precision="I64" names="167" />
			</output>
		</layer>
		<layer id="67" name="__module.pretrained.blocks.0.attn/aten::select/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="209,k.1">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.pretrained.blocks.0.attn/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="212,attn.1">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>1370</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.pretrained.blocks.0.attn/aten::softmax/Softmax" type="SoftMax" version="opset8">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>1370</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="213,input.3">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>1370</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="168" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="1733534" size="8" />
			<output>
				<port id="0" precision="I64" names="168" />
			</output>
		</layer>
		<layer id="71" name="__module.pretrained.blocks.0.attn/aten::select/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>3</dim>
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32" names="210,v.1">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.pretrained.blocks.0.attn/aten::matmul/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>1370</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="215">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.pretrained.blocks.0.attn/aten::transpose/ScatterElementsUpdate_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="1733542" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.pretrained.blocks.0.attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>6</dim>
					<dim>1370</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="216">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.pretrained.blocks.0.attn/prim::ListConstruct/Concat_1" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="1733558" size="24" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="217">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.pretrained.blocks.0.attn/aten::reshape/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>6</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="218,input.5">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.pretrained.blocks.0.attn/aten::reshape/Reshape_1_0_0/nncf_smooth_quant/scale" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="1733582" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="__module.pretrained.blocks.0.attn/aten::reshape/Reshape_1_0_0/nncf_smooth_quant" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.pretrained.blocks.0.attn/aten::reshape/Reshape_1_0_0/nncf_smooth_quant/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1735118" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="80" name="__module.pretrained.blocks.0.attn/aten::reshape/Reshape_1_0_0/nncf_smooth_quant/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1735122" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="81" name="__module.pretrained.blocks.0.attn/aten::reshape/Reshape_1_0_0/nncf_smooth_quant/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1735118" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="82" name="__module.pretrained.blocks.0.attn/aten::reshape/Reshape_1_0_0/nncf_smooth_quant/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1735122" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="83" name="__module.pretrained.blocks.0.attn/aten::reshape/Reshape_1_0_0/nncf_smooth_quant/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_546459" type="Const" version="opset1">
			<data element_type="i8" shape="384, 384" offset="1735126" size="147456" />
			<output>
				<port id="0" precision="I8">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Convert_546460" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_546461" type="Const" version="opset1">
			<data element_type="f32" shape="384, 1" offset="1882582" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Multiply_14874/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Multiply_14874" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>384</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_15351_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="1884118" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_15351" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.pretrained.blocks.0.ls1/aten::mul/Multiply" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="224">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.pretrained.blocks.0/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="225,input.9">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.pretrained.blocks.0.norm2/aten::layer_norm/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="1281056" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.pretrained.blocks.0.norm2/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999999747524271e-07" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_15352_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="1884886" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_15352" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="__module.pretrained.blocks.0.norm2/aten::layer_norm/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Constant_15353_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 384" offset="1885654" size="768" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_15353" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="__module.pretrained.blocks.0.norm2/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="229,input.11">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="__module.pretrained.blocks.0.norm2/aten::layer_norm/Add_0_0/nncf_smooth_quant/scale" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 384" offset="1886422" size="1536" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="__module.pretrained.blocks.0.norm2/aten::layer_norm/Add_0_0/nncf_smooth_quant" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.pretrained.blocks.0.norm2/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1887958" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="104" name="__module.pretrained.blocks.0.norm2/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1887962" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="105" name="__module.pretrained.blocks.0.norm2/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1887958" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="106" name="__module.pretrained.blocks.0.norm2/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="1887962" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="107" name="__module.pretrained.blocks.0.norm2/aten::layer_norm/Add_0_0/nncf_smooth_quant/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_546464" type="Const" version="opset1">
			<data element_type="i8" shape="1536, 384" offset="1887966" size="589824" />
			<output>
				<port id="0" precision="I8">
					<dim>1536</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Convert_546465" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>1536</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_546466" type="Const" version="opset1">
			<data element_type="f32" shape="1536, 1" offset="2477790" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1536</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.pretrained.blocks.0.mlp.fc1/aten::linear/MatMul/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1536</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1536</dim>
					<dim>384</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.pretrained.blocks.0.mlp.fc1/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>384</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1536</dim>
					<dim>384</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_15354_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1536" offset="2483934" size="3072" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_15354" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="__module.pretrained.blocks.0.mlp.fc1/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="236,input.13">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.pretrained.blocks.0.mlp.act/aten::gelu/Gelu" type="Gelu" version="opset7">
			<data approximation_mode="ERF" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="237,input.15">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.pretrained.blocks.0.mlp.act/aten::gelu/Gelu_0_0/nncf_smooth_quant/scale" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1536" offset="2487006" size="6144" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="__module.pretrained.blocks.0.mlp.act/aten::gelu/Gelu_0_0/nncf_smooth_quant" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1536</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="__module.pretrained.blocks.0.mlp.act/aten::gelu/Gelu_0_0/nncf_smooth_quant/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2493150" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="120" name="__module.pretrained.blocks.0.mlp.act/aten::gelu/Gelu_0_0/nncf_smooth_quant/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2493154" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="121" name="__module.pretrained.blocks.0.mlp.act/aten::gelu/Gelu_0_0/nncf_smooth_quant/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2493150" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="122" name="__module.pretrained.blocks.0.mlp.act/aten::gelu/Gelu_0_0/nncf_smooth_quant/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="2493154" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="123" name="__module.pretrained.blocks.0.mlp.act/aten::gelu/Gelu_0_0/nncf_smooth_quant/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>1536</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1370</dim>
					<dim>1536</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Constant_546469" type="Const" version="opset1">
			<data element_type="i8" shape="384, 1536" offset="2493158" size="589824" />
			<output>
